Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.61/svd/ATSAMR34J17B.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_IOBUS</name>
         <prependToName>PORT_IOBUS_</prependToName>
         <baseAddress>0x60000000</baseAddress>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>U22152.1.0</version>
         <description>Peripheral Touch Controller</description>
         <groupName>PTC</groupName>
         <prependToName>PTC_</prependToName>
         <baseAddress>0x43001400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1</size>
            <usage>reserved</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>25</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>U22391.1.0</version>
         <description>Reset Controller</description>
         <groupName>RSTC</groupName>
         <prependToName>RSTC_</prependToName>
         <baseAddress>0x40000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x12</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCAUSE</name>
               <description>Reset Cause</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power On Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD12</name>
                     <description>Brown Out 12 Detector Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33</name>
                     <description>Brown Out 33 Detector Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>External Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Watchdog Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYST</name>
                     <description>System Reset Request</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKUPEXIT</name>
               <description>Backup Exit Source</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EXTWAKE</name>
                     <description>External Wakeup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC</name>
                     <description>Real Timer Counter Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBPS</name>
                     <description>Battery Backup Power Switch</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WKDBCONF</name>
               <description>Wakeup Debounce Configuration</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>WKDBCNT</name>
                     <description>Wakeup Debounce Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>WKDBCNTSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No debouncing.Input pin is low or high level sensitive depending on its WKPOLx bit.</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2CK32</name>
                           <description>Input pin shall be active for at least two 32kHz clock period.</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3CK32</name>
                           <description>Input pin shall be active for at least three 32kHz clock period.</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32CK32</name>
                           <description>Input pin shall be active for at least 32 32kHz clock period.</description>
                           <value>0x03</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512CK32</name>
                           <description>Input pin shall be active for at least 512 32kHz clock period.</description>
                           <value>0x04</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4096CK32</name>
                           <description>Input pin shall be active for at least 4096 32kHz clock period.</description>
                           <value>0x05</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32768CK32</name>
                           <description>Input pin shall be active for at least 32768 32kHz clock period.</description>
                           <value>0x06</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WKPOL</name>
               <description>Wakeup Polarity</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>WKPOL</name>
                     <description>Wakeup Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WKEN</name>
               <description>Wakeup Enable</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>WKEN</name>
                     <description>Wakeup Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WKCAUSE</name>
               <description>Wakeup Cause</description>
               <addressOffset>0x10</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>WKCAUSE</name>
                     <description>Wakeup Cause</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
